In [0]:
import pandas as pd
df1 = pd.read_csv('./songsFrequency.csv')
df2 = pd.read_csv('./processed/third.csv')
dfp = pd.read_csv('./processed/movie_plot.csv')

In [0]:
df1.columns = ['MOVIE', 'YEAR', 'MALE SINGER COUNT', 'FEMALE SINGER COUNT', 'MALE SONG COUNT', 'FEMALE SONG COUNT']
df1.columns = df1.columns.str.lower()
df1 = df1[['movie', 'year']]
df1.columns

Index(['movie', 'year'], dtype='object')

In [0]:
df2.head()

,Unnamed: 0,name,gender,character,movie name,mentions,count,total centrality,average centrality
0,0,seema_chetna,FEMALE,unrecognizable,Chetna,23.0,170.0,227.500000,1.338235
1,1,janki_geet,FEMALE,"sister, sister, sister",Geet,7.0,56.0,220.166667,3.931548
2,2,deepa_jeevan mrityu,FEMALE,"mother, mother, mother",Jeevan Mrityu,5.0,53.0,27.000000,0.509434
3,3,poonam_kati patang,FEMALE,real,Kati Patang,21.0,177.0,685.699553,3.874009
4,4,radha_khilona,FEMALE,young,Khilona,11.0,78.0,118.500000,1.519231

In [0]:
df1.head()

                              movie  year
0                Raabta (film)_2017  2017
1                 Luv U Soniyo_2013  2013
2                     Sahibaan_1993  1993
3  Baap Numbri Beta Dus Numbri_1990  1990
4             Jyoti Bane Jwala_1980  1980

In [0]:
def function(x):
    return x.split("_")[0]
df1['movie'] = df1['movie'].apply(lambda x: function(x))

C:\ProgramData\Miniconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [0]:
df1.head()

                         movie  year
0                Raabta (film)  2017
1                 Luv U Soniyo  2013
2                     Sahibaan  1993
3  Baap Numbri Beta Dus Numbri  1990
4             Jyoti Bane Jwala  1980

In [0]:
df1['movie'] = df1['movie'].str.lower()
df1.head()

C:\ProgramData\Miniconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

                         movie  year
0                raabta (film)  2017
1                 luv u soniyo  2013
2                     sahibaan  1993
3  baap numbri beta dus numbri  1990
4             jyoti bane jwala  1980

In [0]:
df2 = df2[['name', 'gender', 'character', 'movie name', 'mentions','count', 'total centrality', 'average centrality']]

In [0]:
df2.columns

Index(['name', 'gender', 'character', 'movie name', 'mentions', 'count',
       'total centrality', 'average centrality'],
      dtype='object')

In [0]:
df2.columns = ['name', 'gender', 'character', 'movie', 'mentions', 'count','total centrality', 'average centrality']

In [0]:
df2.columns

Index(['name', 'gender', 'character', 'movie', 'mentions', 'count',
       'total centrality', 'average centrality'],
      dtype='object')

In [0]:
dfp = dfp[['movie', 'plot']]
dfp.head()

                movie                                               plot
0            100 days   The film opens with a young woman  Devi  who ...
1                 13b   Manohar moves into a new apartment  13B  on t...
2         16 december   A four member team -- Vir Vijay Singh  Vikram...
3                1920   In the year 1920 at Palampur  India  an archi...
4  2001: do hazaar ek   Following the brutal slaying of a call-girl n...

In [0]:
df1.head()

                         movie  year
0                raabta (film)  2017
1                 luv u soniyo  2013
2                     sahibaan  1993
3  baap numbri beta dus numbri  1990
4             jyoti bane jwala  1980

In [0]:
result2 = pd.merge(dfp, df1[['movie', 'year']], on='movie', how='right')
result2.head()

                movie                                               plot  year
0  2001: do hazaar ek   Following the brutal slaying of a call-girl n...  1998
1           36 ghante   Three hardcore criminals escape from a jail b...  1974
2   aa ab laut chalen   Rohan Khanna is a jobless graduate living wit...  1999
3      aa dekhen zara   Ray Acharya  a struggling photographer has no...  2009
4    aadmi aur apsara   Raju  a courageous and spirited young man  is...  1991

In [0]:
result2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2449 entries, 0 to 2448
Data columns (total 3 columns):
movie    2449 non-null object
plot     790 non-null object
year     2449 non-null int64
dtypes: int64(1), object(2)
memory usage: 76.5+ KB

In [0]:
result2.to_csv(path_or_buf='./processed/movie_plot2.csv', index=True)